# 구하고자 하는 피보나치 수열의 번째 수(N) 입력받기
목표_순서 = int(input())

메모장 = [0] * 100

# 피보나치 숫자를 구하는 함수 만들기
def 피보나치(현재_순서):
    # 0번째와 1번째 숫자는 0과 1로 규칙이 정해져 있으므로 바로 돌려줌
    if 현재_순서 == 0:
        return 0
    if 현재_순서 == 1:
        return 1
    
    # 만약 메모장에 이미 계산해 둔 정답(0이 아닌 숫자)이 있다면 
    if 메모장[현재_순서] != 0:
        return 메모장[현재_순서] # 다시 덧셈하지 않고 메모장 값을 그대로 쏙 빼서 씀.
    
    # 아직 계산 안 한 숫자라면, 앞의 두 숫자를 더해서 새로 계산한 뒤 메모장에 적어둠
    메모장[현재_순서] = 피보나치(현재_순서 - 1) + 피보나치(현재_순서 - 2)
    
    # 방금 메모장에 적은 그 숫자를 정답으로 돌려줌
    return 메모장[현재_순서]

# 4. 입력받은 목표 순서의 피보나치 숫자를 구해서 출력
print(피보나치(목표_순서))
